# GetCellFormatOptions Method (Int32, Document)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TableSectionData..::..GetCellFormatOptions Method (Int32, Document)
TableSectionData Class See Also
---
Returns a column's cell FormatOptions and if no FormatOptions exists for this column, it would come from the section.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public FormatOptions GetCellFormatOptions(
	int nCol,
	Document dcument
)
```

Visual Basic
---
```text
Public Function GetCellFormatOptions ( _
	nCol As Integer, _
	dcument As Document _
) As FormatOptions
```

Visual C++
---
```text
public:
FormatOptions^ GetCellFormatOptions(
	int nCol,
	Document^ dcument
)
```

# ### Parameters
nCol
    Type: System..::..Int32
dcument
    Type: Autodesk.Revit.DB..::..Document
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The given column number nCol is invalid. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
TableSectionData Class
GetCellFormatOptions Overload
Autodesk.Revit.DB Namespace